src/Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеЗапасов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	
	
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.Ссылка КАК Документ,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Склад КАК Склад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СкладПолучатель КАК СкладПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ПеремещениеЗапасовЗапасы.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы) КАК СчетКт,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК СубконтоДт1,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СкладПолучатель КАК СубконтоДт2,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК СубконтоКт1,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Склад КАК СубконтоКт2,
	|	0 КАК Сумма,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	""Перемещение запасов"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|	И ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)";
	
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаПеремещениеЗапасов);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаЗапасыНаСкладах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(СтруктураДополнительныеСвойства)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.СкладПолучатель,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаПолучатель,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.СкладПолучатель,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиницаПолучатель,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	СУММА(ВременнаяТаблицаУправленческий.Сумма) КАК Сумма,
	|	СУММА(ВременнаяТаблицаУправленческий.Количество) КАК Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.Содержание";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры


// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция СформироватьПечатнуюФормуНакладнойНаПеремещениеТоваров(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_НакладнаяНаПеремещение");
	
	// ОбластьЗаголовка  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьНомераЗаголовок = Макет.ПолучитьОбласть("Заголовок|НомерСтроки");
	ОбластьКодовЗаголовок  =  Макет.ПолучитьОбласть("Заголовок|КолонкаКодов");
	ОбластьУпаковокЗаголовок  =  Макет.ПолучитьОбласть("Заголовок|КолонкаУпаковок");
	ОбластьДанныхЗаголовок = Макет.ПолучитьОбласть("Заголовок|Товар");
	ОбластьКонецСтрокиЗаголовок = Макет.ПолучитьОбласть("Заголовок|КонецСтроки");
	
	ОбластьОрганизация = Макет.ПолучитьОбласть("ОрганизацияОтправитель");
	// ОбластьТовары = Макет.Область("Товар");
	// ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
	
	ОбластьНомераШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодовШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьУпаковокШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаУпаковок");
	ОбластьДанныхШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	ОбластьКонецСтрокиШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	
	ОбластьНомераСтрока = Макет.ПолучитьОбласть("Строка1|НомерСтроки");
	ОбластьКодовСтрока =  Макет.ПолучитьОбласть("Строка1|КолонкаКодов");
	ОбластьУпаковокСтрока =  Макет.ПолучитьОбласть("Строка1|КолонкаУпаковок");
	ОбластьДанныхСтрока = Макет.ПолучитьОбласть("Строка1|Товар");
	ОбластьКонецСтрокиСтрока = Макет.ПолучитьОбласть("Строка1|КонецСтроки");
	
	ОбластьНомераПодвал = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
	ОбластьКодовПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаКодов");
	ОбластьУпаковокПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаУпаковок");
	ОбластьДанныхПодвал = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьКонецСтрокиПодвал = Макет.ПолучитьОбласть("Подвал|КонецСтроки");
	
	ОбластьПодписей = Макет.ПолучитьОбласть("Подписи");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ПеремещениеЗапасов.Номер,
	              |	ПеремещениеЗапасов.Дата КАК Дата,
	              |	ПеремещениеЗапасов.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	              |	ПеремещениеЗапасов.Склад.Представление КАК ОтправительПредставление,
	              |	ПеремещениеЗапасов.СкладПолучатель.Представление КАК ПолучательПредставление,
	              |	ПеремещениеЗапасов.СтруктурнаяЕдиница.Организация.Наименование КАК ОрганизацияПредставление,
	              |	ПеремещениеЗапасов.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
	              |ГДЕ
	              |	ПеремещениеЗапасов.Ссылка В(&МассивДокументов)
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата,
	              |	Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ПеремещениеЗапасовЗапасы.Номенклатура КАК Товар,
	              |	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.Код КАК Код,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения КАК ПредставлениеЕдининицыИзмеренияУпаковки,
	              |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения,
	              |	ПеремещениеЗапасовЗапасы.КоличествоУпаковок,
	              |	ПеремещениеЗапасовЗапасы.Количество,
	              |	ПеремещениеЗапасов.Ссылка КАК Ссылка,
	              |	ПеремещениеЗапасовЗапасы.Упаковка.Коэффициент КАК Коэффициент,
	              |	ПеремещениеЗапасовЗапасы.Упаковка,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.Артикул КАК Артикул,
	              |	ПеремещениеЗапасовЗапасы.Партия КАК Партия
	              |ИЗ
	              |	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
	              |		ПО ПеремещениеЗапасовЗапасы.Ссылка = ПеремещениеЗапасов.Ссылка
	              |ГДЕ
	              |	ПеремещениеЗапасов.Ссылка В(&МассивДокументов)
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Ссылка,
	              |	НомерСтроки
	              |ИТОГИ ПО
	              |	Ссылка"  ;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Шапка = РезультатЗапроса[0].Выбрать();
	ВыборкаТЧ = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПервыйДокумент = Истина;
	
	ДопКолонка = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПечатныхФормДокументов");
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ВыборкаТЧ.НайтиСледующий(Новый Структура("Ссылка", Шапка.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаСтрокТовары = ВыборкаТЧ.Выбрать();
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Выводим шапку накладной
		ОбластьНомераЗаголовок.Параметры.ТекстЗаголовка = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Шапка, "Накладная на перемещение");
		ТабДокумент.Вывести(ОбластьНомераЗаголовок);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовЗаголовок);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьУпаковокЗаголовок);
		ТабДокумент.Присоединить(ОбластьДанныхЗаголовок);
		ТабДокумент.Присоединить(ОбластьКонецСтрокиЗаголовок);
		
		ОбластьОрганизация.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьОрганизация);
		
		// ОбластьЗаголовка.Параметры.ТекстЗаголовка = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Шапка, "Накладная на перемещение");
		// ОбластьЗаголовка.Параметры.Заполнить(Шапка);
		// ТабДокумент.Вывести(ОбластьЗаголовка);
		ТабДокумент.Вывести(ОбластьНомераШапка);
		Если ВыводитьКоды Тогда
			ОбластьКодовШапка.Параметры.ИмяКолонкиКодов = Колонка;
			ТабДокумент.Присоединить(ОбластьКодовШапка);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанныхШапка); 
		ТабДокумент.Присоединить(ОбластьУпаковокШапка);
		ТабДокумент.Присоединить(ОбластьКонецСтрокиШапка);
		
		// Выборка товаров
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			ОбластьНомераСтрока.Параметры.НомерСтроки = ВыборкаСтрокТовары.НомерСтроки;
			ТабДокумент.Вывести(ОбластьНомераСтрока);
			
			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодовСтрока.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				Иначе
					ОбластьКодовСтрока.Параметры.Артикул = ВыборкаСтрокТовары.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодовСтрока);
			КонецЕсли;
			
			ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанныхСтрока.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати
			(ВыборкаСтрокТовары.ТоварНаименование, Неопределено);
			
			ТабДокумент.Присоединить(ОбластьДанныхСтрока);
			
			ОбластьУпаковокСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			Если  НЕ ВыборкаСтрокТовары.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка() Тогда
				ПредставлениеУпаковки = ОбластьУпаковокСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки;
				ПредставлениеУпаковки = ?(ЗначениеЗаполнено(ПредставлениеУпаковки), " " + ПредставлениеУпаковки, " шт.");
				ОбластьУпаковокСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаСтрокТовары.Упаковка.Наименование + " (" + ВыборкаСтрокТовары.Коэффициент + ПредставлениеУпаковки + ")";				
			КонецЕсли;
			
			ТабДокумент.Присоединить(ОбластьУпаковокСтрока);
			
			ОбластьКонецСтрокиСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьКонецСтрокиСтрока);
			
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьНомераПодвал);  
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовПодвал);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанныхПодвал);
		ТабДокумент.Присоединить(ОбластьУпаковокПодвал);
		ТабДокумент.Присоединить(ОбластьКонецСтрокиПодвал);
		
		// Вывести подписи.
		ТабДокумент.Вывести(ОбластьПодписей);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьПеремещениеТоваров()

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ
//  &НаКлиенте
// Функция ВидЦен()
//	СтруктураПараметров = Новый Структура;
//	СтруктураЦены = ОткрытьФормуМодально("ОбщаяФорма.ФормаЦены", СтруктураПараметров);
//	Возврат  СтруктураЦены.ВидЦен;
// КонецФункции
//  
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция СформироватьПечатнуюФормуНакладнойНаПеремещениеТоваровПоТипуЦен(МассивОбъектов, ОбъектыПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_НакладнаяНаПеремещениеПоТипуЦен");
	
	ОбластьНомераЗаголовок = Макет.ПолучитьОбласть("Заголовок|НомерСтроки");
	ОбластьКодовЗаголовок  =  Макет.ПолучитьОбласть("Заголовок|КолонкаКодов");
	ОбластьУпаковокЗаголовок  =  Макет.ПолучитьОбласть("Заголовок|КолонкаУпаковок");
	ОбластьДанныхЗаголовок = Макет.ПолучитьОбласть("Заголовок|Товар");
	ОбластьКонецСтрокиЗаголовок = Макет.ПолучитьОбласть("Заголовок|КонецСтроки");
	ОбластьОрганизация = Макет.ПолучитьОбласть("ОрганизацияОтправитель");
	
	ОбластьНомераШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодовШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьУпаковокШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаУпаковок");
	ОбластьДанныхШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	ОбластьКонецСтрокиШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	
	ОбластьНомераСтрока = Макет.ПолучитьОбласть("Строка1|НомерСтроки");
	ОбластьКодовСтрока =  Макет.ПолучитьОбласть("Строка1|КолонкаКодов");
	ОбластьУпаковокСтрока =  Макет.ПолучитьОбласть("Строка1|КолонкаУпаковок");
	ОбластьДанныхСтрока = Макет.ПолучитьОбласть("Строка1|Товар");
	ОбластьКонецСтрокиСтрока = Макет.ПолучитьОбласть("Строка1|КонецСтроки");
	
	ОбластьНомераПодвал = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
	ОбластьКодовПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаКодов");
	ОбластьУпаковокПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаУпаковок");
	ОбластьДанныхПодвал = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьКонецСтрокиПодвал = Макет.ПолучитьОбласть("Подвал|КонецСтроки");
	ОбластьПодписей = Макет.ПолучитьОбласть("Подписи");
	
	ОбластьЦенаЗаголовок = Макет.ПолучитьОбласть("Заголовок|Цена");
	ОбластьЦенаШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
	ОбластьЦенаСтрока = Макет.ПолучитьОбласть("Строка|Цена");
	ОбластьЦенаПодвал = Макет.ПолучитьОбласть("Подвал|Цена");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Дата = Неопределено; // МассивОбъектов[0][0].Дата
	
	Для Каждого ДокументИзМассива Из МассивОбъектов[0] Цикл
		Дата = ?(Дата = Неопределено, ДокументИзМассива.Дата, Дата);
		Дата = ?(ДокументИзМассива.Дата > Дата, ДокументИзМассива.Дата, Дата);
	КонецЦикла;
		
	ВидЦен = МассивОбъектов[1];

	Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст ="ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	              |	ПеремещениеЗапасов.Номер,
	              |	ПеремещениеЗапасов.Дата КАК Дата,
	              |	ПеремещениеЗапасов.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	              |	ПеремещениеЗапасов.Склад.Представление КАК ОтправительПредставление,
	              |	ПеремещениеЗапасов.СкладПолучатель.Представление КАК ПолучательПредставление,
	              |	ПеремещениеЗапасов.СтруктурнаяЕдиница.Организация.Наименование КАК ОрганизацияПредставление,
	              |	ПеремещениеЗапасов.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
	              |ГДЕ
	              |	ПеремещениеЗапасов.Ссылка В(&Ссылка)
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата,
	              |	Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ПеремещениеЗапасовЗапасы.Номенклатура КАК Товар,
	              |	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.Код КАК Код,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения КАК ПредставлениеЕдининицыИзмеренияУпаковки,
	              |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения,
	              |	ПеремещениеЗапасовЗапасы.КоличествоУпаковок,
	              |	ПеремещениеЗапасовЗапасы.Количество,
	              |	ПеремещениеЗапасов.Ссылка КАК Ссылка,
	              |	ПеремещениеЗапасовЗапасы.Упаковка.Коэффициент КАК Коэффициент,
	              |	ПеремещениеЗапасовЗапасы.Упаковка,
	              |	ПеремещениеЗапасовЗапасы.Партия,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.Артикул КАК Артикул,
	              |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	              |	ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасовЗапасы.КоличествоУпаковок КАК Сумма,
	              |	ПеремещениеЗапасов.Дата
	              |ИЗ
	              |	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
	              |		ПО ПеремещениеЗапасовЗапасы.Ссылка = ПеремещениеЗапасов.Ссылка
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	              |				&Дата,
	              |				Актуальность = ИСТИНА
	              |					И Номенклатура В
	              |						(ВЫБРАТЬ
	              |							ПеремещениеЗапасовЗапасы.Номенклатура
	              |						ИЗ
	              |							Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы)
	              |					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	              |		ПО ПеремещениеЗапасовЗапасы.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	              |ГДЕ
	              |	ПеремещениеЗапасов.Ссылка В(&Ссылка)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ПеремещениеЗапасовЗапасы.Номенклатура,
	              |	ПеремещениеЗапасовЗапасы.НомерСтроки,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.Код,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения,
	              |	ПеремещениеЗапасовЗапасы.КоличествоУпаковок,
	              |	ПеремещениеЗапасовЗапасы.Количество,
	              |	ПеремещениеЗапасов.Ссылка,
	              |	ПеремещениеЗапасовЗапасы.Упаковка.Коэффициент,
	              |	ПеремещениеЗапасовЗапасы.Упаковка,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.Артикул,
	              |	ПеремещениеЗапасовЗапасы.Партия,
	              |	ПеремещениеЗапасов.Дата,
	              |	ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасовЗапасы.КоличествоУпаковок,
	              |	ПеремещениеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Ссылка,
	              |	НомерСтроки
	              |ИТОГИ
	              |	СУММА(Сумма)
	              |ПО
	              |	Ссылка";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Шапка = РезультатЗапроса[0].Выбрать();
	ВыборкаТЧ = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПервыйДокумент = Истина;
	
	ДопКолонка = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПечатныхФормДокументов");
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ВыборкаТЧ.НайтиСледующий(Новый Структура("Ссылка", Шапка.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаСтрокТовары = ВыборкаТЧ.Выбрать();
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Выводим шапку накладной
		ОбластьНомераЗаголовок.Параметры.ТекстЗаголовка = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Шапка, "Накладная на перемещение");
		ТабДокумент.Вывести(ОбластьНомераЗаголовок);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовЗаголовок);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьУпаковокЗаголовок);
		ТабДокумент.Присоединить(ОбластьДанныхЗаголовок);
		ТабДокумент.Присоединить(ОбластьКонецСтрокиЗаголовок);
		ТабДокумент.Присоединить(ОбластьЦенаЗаголовок);
		ОбластьОрганизация.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьОрганизация);
		ТабДокумент.Вывести(ОбластьНомераШапка);
		Если ВыводитьКоды Тогда
			ОбластьКодовШапка.Параметры.ИмяКолонкиКодов = Колонка;
			ТабДокумент.Присоединить(ОбластьКодовШапка);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанныхШапка); 
		ТабДокумент.Присоединить(ОбластьУпаковокШапка);
		ТабДокумент.Присоединить(ОбластьКонецСтрокиШапка);
		ТабДокумент.Присоединить(ОбластьЦенаШапка);
		
		// Выборка товаров
		Итого = 0;
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			ОбластьНомераСтрока.Параметры.НомерСтроки = ВыборкаСтрокТовары.НомерСтроки;
			ТабДокумент.Вывести(ОбластьНомераСтрока);
			
			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодовСтрока.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				Иначе
					ОбластьКодовСтрока.Параметры.Артикул = ВыборкаСтрокТовары.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодовСтрока);
			КонецЕсли;
			ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанныхСтрока.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати
			(ВыборкаСтрокТовары.Товар, Неопределено);
			ТабДокумент.Присоединить(ОбластьДанныхСтрока);
			ОбластьУпаковокСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			Если  НЕ ВыборкаСтрокТовары.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка() Тогда
				ПредставлениеУпаковки = ОбластьУпаковокСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки;
				ПредставлениеУпаковки = ?(ЗначениеЗаполнено(ПредставлениеУпаковки), " " + ПредставлениеУпаковки, " шт.");
				ОбластьУпаковокСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаСтрокТовары.Упаковка.Наименование + " (" + ВыборкаСтрокТовары.Коэффициент + ПредставлениеУпаковки + ")";
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьУпаковокСтрока);
			ОбластьКонецСтрокиСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьКонецСтрокиСтрока);
			ОбластьЦенаСтрока.Параметры.Цена = ВыборкаСтрокТовары.Цена;
			ОбластьЦенаСтрока.Параметры.Сумма = ВыборкаСтрокТовары.Сумма; 
			ТабДокумент.Присоединить(ОбластьЦенаСтрока); 	
		КонецЦикла;
		ТабДокумент.Вывести(ОбластьНомераПодвал);  
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовПодвал);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанныхПодвал);
		ТабДокумент.Присоединить(ОбластьУпаковокПодвал);
		ТабДокумент.Присоединить(ОбластьКонецСтрокиПодвал);
		ОбластьЦенаПодвал.Параметры.Сумма =  ВыборкаТЧ.Сумма;
		ТабДокумент.Присоединить(ОбластьЦенаПодвал);
		// Вывести подписи.
		ТабДокумент.Вывести(ОбластьПодписей);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьПеремещениеТоваров()


// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаПеремещение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"НакладнаяНаПеремещение",
		"Накладная на перемещение",
		СформироватьПечатнуюФормуНакладнойНаПеремещениеТоваров(МассивОбъектов, ОбъектыПечати)
		);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаПеремещениеПоТипуЦен") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"НакладнаяНаПеремещениеПоТипуЦен",
		"Накладная на перемещение по типу цен",
		СформироватьПечатнуюФормуНакладнойНаПеремещениеТоваровПоТипуЦен(МассивОбъектов, ОбъектыПечати)
		);
	КонецЕсли;
КонецПроцедуры

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("НакладнаяНаПеремещение", "Накладная на перемещение", , БиблиотекаКартинок.Документ);
	Список.Добавить("НакладнаяНаПеремещениеПоТипуЦен", "Накладная на перемещение по типу цен", , БиблиотекаКартинок.Документ);
		
	Возврат Список;
	
КонецФункции

// Процедура - устанавливает фильтр для списков документов
//
Процедура УстановитьФильтр(СтрЕдиницаОтбор,ВидОперацииОтбор,СкладСотрудникОтбор,Список) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПеремещениеЗапасов.Дата КАК Дата,
	|		ПеремещениеЗапасов.Номер КАК Номер,
	|		ПеремещениеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ПеремещениеЗапасов.ВидОперации КАК ВидОперации,
	|		ПеремещениеЗапасов.Склад КАК Склад,
	|		ПеремещениеЗапасов.СкладПолучатель КАК СкладПолучатель,
	|		ПеремещениеЗапасов.АвторДокумента КАК АвторДокумента,
	|		ПеремещениеЗапасов.Комментарий КАК Комментарий,
	|		ПеремещениеЗапасов.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.ВидОперации = &ВидОперации
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТипСкладСотрудник = ""Не определено""
	|					ИЛИ &СкладСотрудник = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|					ИЛИ &СкладСотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.Склад = &СкладСотрудник
	|					ИЛИ ВложенныйЗапрос.СкладПолучатель = &СкладСотрудник
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтрЕдиницаОтбор);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперацииОтбор);
	Запрос.УстановитьПараметр("ТипСкладСотрудник", Строка(ТипЗнч(СкладСотрудникОтбор)));
	Запрос.УстановитьПараметр("СкладСотрудник", СкладСотрудникОтбор);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", Результат, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.Поступление.ТабличнаяЧасть.Запасы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, , , , );
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", "Код", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 4, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 6,,Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Партия (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);	
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , ,);	
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПоУмолчанию", "Упаковка поступления", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПродажи", "Упаковка продажи", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	НастройкиОбновленияСвойств  = ПараметрыСопоставления.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ПолноеИмяОбъектаЗаполнения 	= НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;

	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодСинхронизации
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, 
			СтрокаТаблицыФормы.Штрихкод, 
			СтрокаТаблицыФормы.Артикул, 
			СтрокаТаблицыФормы.НоменклатураНаименование, 
			СтрокаТаблицыФормы.НоменклатураНаименованиеПолное, 
			СтрокаТаблицыФормы.Код,
			СтрокаТаблицыФормы.КодСинхронизации);
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Номенклатура", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель)
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель_ВходящиеДанные) Тогда
			
			ГруппаНоменклатуры = Справочники.Номенклатура.СоздатьГруппу();
			ГруппаНоменклатуры.Наименование = СтрокаТаблицыФормы.Родитель_ВходящиеДанные;
			ГруппаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
			ГруппаНоменклатуры.Записать();
			СтрокаТаблицыФормы.Родитель = ГруппаНоменклатуры.Ссылка;
			
		КонецЕсли;
		
		// Упаковк по умолчанию
		ЗначениеПоУмолчанию = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПоУмолчанию, СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура, ЗначениеПоУмолчанию);
		
		// Коэффициент
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, 1);
		
		Если НЕ ЭтаСтрокаСопоставлена
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) Тогда
						
			ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();	
			ЭлементСправочника.Заполнить(Новый Структура("Родитель", СтрокаТаблицыФормы.Родитель));
			ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицыФормы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(ПараметрыСопоставления.НастройкиЗагрузкиДанных));
			ЭлементСправочника.Записать();
			СтрокаТаблицыФормы.Номенклатура = ЭлементСправочника.Ссылка;
			
			ЭлементСправочника.Наименование = СтрокаТаблицыФормы.НоменклатураНаименование;
			ЭлементСправочника.НаименованиеПолное = ?(ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное), СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
			ЭлементСправочника.ЭтоУслуга = ?(ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Истина, Ложь);
			// ЭлементСправочника.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
						
			Если Не ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные) Тогда
				
				// Создать упаковку по умолчанию
				НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
				НоваяУпаковка.Наименование = СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные;
				НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
				НоваяУпаковка.Записать();
			 
				ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
				СтрокаТаблицыФормы.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
								
			КонецЕсли;
			
			ЭлементСправочника.Записать();

		КонецЕсли;
				
		Если ПолноеИмяОбъектаЗаполнения = "Документ.ПеремещениеЗапасов.ТабличнаяЧасть.Запасы" Тогда
			
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
				
				СтрокаТаблицыФормы.Номенклатура = Неопределено;
				
			КонецЕсли;
			
			//// Партия по Владельцу и Наименованию
			// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
						
			// ХарактеристикаСсылка = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				СсылкаНомеклатуры = СтрокаТаблицыФормы.Номенклатура.Ссылка;
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия_ВходящиеДанные) Тогда
					
					НомеклатураОбъект = СсылкаНомеклатуры.ПолучитьОбъект();
					Если НомеклатураОбъект.ИспользоватьПартии = Ложь Тогда
						НомеклатураОбъект.ИспользоватьПартии = Истина;
						НомеклатураОбъект.Записать();
					КонецЕсли;
					
					НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, СсылкаНомеклатуры, Новый Структура("Наименование", СтрокаТаблицыФормы.Партия_ВходящиеДанные));
					Если НоваяХарактеристика.Следующий() Тогда
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					Иначе
						НоваяХарактеристика              = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
						НоваяХарактеристика.Владелец     = СсылкаНомеклатуры;
						НоваяХарактеристика.Наименование = СтрокаТаблицыФормы.Партия_ВходящиеДанные;
						НоваяХарактеристика.Записать();
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
	
		КонецЕсли;
								
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.ПеремещениеЗапасов.ТабличнаяЧасть.Запасы" Тогда
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
			И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			И СтрокаТаблицыФормы.Количество <> 0;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
